/*******************************************************************************************************************************************
* 文件名：browserclient.h
* 文件描述：973智慧协同网络SAR系统TestBed套件——浏览器本地协议转接件，上端连接浏览器软件，下端连接数据请求端（Data Subscriber）
* 声明：本模板代码作者王兆旭，为北京交通大学下一代互联网互联设备国家工程实验室新生基础工程技术培训专用。作者王兆旭在此郑重声明，此文件及其它用于培训的模板代码均为本人精力与经验的产物，本资源的传播方式均为作者本人向他人进行一对一传授，任何个人不得向第三方转交或展示该资源内容。任何有需求的学员，均须向王兆旭本人直接索要，亦无向他人索要或传授之权利和义务。因有些资源内容涉及实验室项目秘密，暂不考虑申请专利保护或软件著作权等事宜，故个别资源仅限实验室内部一对一发放，如发现有辜负作者本人的一片好意的行为，作者将保留就其原创性进行追查、举证、申诉和问责的权利。本资源的发放权归作者本人所有，其整理和总结过程浸透无偿贡献的热忱和为诸君学业尽绵薄之力的真诚，愿学员尊重作者的劳动成果，谢谢合作！
* 作者：王兆旭
* 身份：北京交通大学下一代互联网互联设备国家工程实验室 2013级硕博连读研究生
* E-mail. hellozxwang@foxmail.com
* Mobile. 18811774990
* QQ    . 535667240
* Addr  . 北京市海淀区西直门外北京交通大学机械楼D706室, 100044
*******************************************************************************************************************************************/
/*******************************************************************************************************************************************
*****功能说明：1.充当上端浏览器软件的本地HTTP服务器
**************2.向下端数据请求端（Data Subscriber）提供所请求的SID，接收DATA并向浏览器软件以HTTP协议返回
*******************************************************************************************************************************************/
/*
快速配置步骤：
1、宏定义修改
DEFAULTDIR指通过网页访问文件系统的根路径，注意系统中是否有/home，没有的话可以自行决定修改为某个路径，对正常运行没有太大影响
PhysicalPort指CoLoR协议发出Get包和接收Data包的网卡端口，注意网卡的默认有线端口名称是否为eth0，而Fedora20系统中的默认名称为em1，请注意识别
2、系统设置
在Fedora系统中因需要使用原始套接字发送自定义格式的数据包，须关闭Fedora的防火墙，命令：
sudo systemctl stop firewalld.service
在Ubuntu系统中无需任何操作
3、编译命令
gcc browserclient.c -o browserclient -lpthread
4、运行（因涉及原始套接字的使用，须root权限）
sudo ./browserclient
*/

#include"subscriber.h"

/*******************************************************************************************************************************************
*************************************宏定义配置数据************全局变量定义******************************************************************
*******************************************************************************************************************************************/
//HTTP服务器外部配置
#define DEFAULTIP     "127.0.0.1"             //接收HTTP请求的本地IP地址（公网地址）
#define DEFAULTPORT   "80"                    //接收HTTP请求的本地端口
#define DEFAULTDIR    "/home"                 //HTTP目录访问服务的根路径

//HTTP服务器内部配置
#define DEFAULTLOG    "./run.log" //程序日志路径
#define DEFAULTBACK   "10"                    //（可能是最大并发任务数）
#define MAX_GETSIDTIME 10                     //等待内网取回Data最长时间

//应用层（HTTP）服务器 - 调用声明与函数
void prterrmsg(char *msg);
#define prterrmsg(msg)         {perror(msg); abort();}
void wrterrmsg(char *msg);
#define wrterrmsg(msg)         {fputs(msg, logfp); fputs(strerror(errno), logfp);fflush(logfp); abort();}


void prtinfomsg(char *msg);
#define prtinfomsg(msg)        {fputs(msg, stdout);}
void wrtinfomsg(char *msg);
#define wrtinfomsg(msg)        {fputs(msg, logfp); fflush(logfp);}

#define MAXPATH 150
#define MAXBUF  1024

char buffer[MAXBUF + 1];
char *host;
char *port;
char *back;
char *dirroot;
char *logdir;
uint8_t daemon_y_n;

FILE *logfp;

/*******************************************************************************************************************************************
*******************************************初始化参数配置相关********************************************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：BrowserClient_Parameterinit
* 功能描述：BrowserClient模块全局变量赋初值
* 参数列表：
* 返回结果：
*****************************************/
void
BrowserClient_Parameterinit();

/*******************************************************************************************************************************************
*******************************************应用层（HTTP）服务器（由browserclient主循环调用和控制）***********************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：BrowserClient_dir_up
* 功能描述：查找dirpath所指目录的上一级目录
* 参数列表：
* 返回结果：
*****************************************/
char *
BrowserClient_dir_up
(
	char * dirpath
);

/*****************************************
* 函数名称：BrowserClient_AllocateMemory
* 功能描述：分配空间并把d所指的内容复制
* 参数列表：
* 返回结果：
*****************************************/
void
BrowserClient_AllocateMemory
(
	char ** s,
	int l,
	char * d
);

/*****************************************
* 函数名称：BrowserClient_GiveResponse
* 功能描述：把Path所指的内容发送到client_sock去
* 参数列表：
* 返回结果：
如果Path是一个目录，则列出目录内容
如果Path是一个文件，则下载文件
*****************************************/
void
BrowserClient_GiveResponse
(
	FILE * client_sock,
	char * Path
);

/*****************************************
* 函数名称：BrowserClient_getoption
* 功能描述：分析取出程序的参数
* 参数列表：
* 返回结果：
*****************************************/
void
BrowserClient_getoption
(
	int argc,
	char argv[][30]
);
/*******************************************************************************************************************************************
*******************************************上行通道 - From.数据请求端   To.应用服务器*********************************************************
*******************************************************************************************************************************************/

/*******************************************************************************************************************************************
*******************************************下行通道 - From.应用服务器 To.数据请求端***********************************************************
*******************************************************************************************************************************************/

/*******************************************************************************************************************************************
**********************************************************多线程主干程序********************************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：BrowserClient_main
* 功能描述：BrowserClient模块主函数，启动ForwardingPlane转发平面线程。自身主循环执行简单HTTP服务器功能。
* 参数列表：
eg: ./sub d1sub1 d1sub1-eth1
第二参数使用char**argv的方式声明报错，不知是不是语法问题
* 返回结果：
*****************************************/
int
BrowserClient_main
(
	int argc,
	char argv[][30]
);
