/*******************************************************************************************************************************************
* 文件名：stringclient.h
* 文件描述：973智慧协同网络SAR系统TestBed套件——长字符串请求端，下端连接数据请求端（Data Subscriber）
* 声明：本模板代码作者王兆旭，为北京交通大学下一代互联网互联设备国家工程实验室新生基础工程技术培训专用。作者王兆旭在此郑重声明，此文件及其它用于培训的模板代码均为本人精力与经验的产物，本资源的传播方式均为作者本人向他人进行一对一传授，任何个人不得向第三方转交或展示该资源内容。任何有需求的学员，均须向王兆旭本人直接索要，亦无向他人索要或传授之权利和义务。因有些资源内容涉及实验室项目秘密，暂不考虑申请专利保护或软件著作权等事宜，故个别资源仅限实验室内部一对一发放，如发现有辜负作者本人的一片好意的行为，作者将保留就其原创性进行追查、举证、申诉和问责的权利。本资源的发放权归作者本人所有，其整理和总结过程浸透无偿贡献的热忱和为诸君学业尽绵薄之力的真诚，愿学员尊重作者的劳动成果，谢谢合作！
* 作者：王兆旭
* 身份：北京交通大学下一代互联网互联设备国家工程实验室 2013级硕博连读研究生
* E-mail. hellozxwang@foxmail.com
* Mobile. 18811774990
* QQ    . 535667240
* Addr  . 北京市海淀区西直门外北京交通大学机械楼D706室, 100044
*******************************************************************************************************************************************/
/*******************************************************************************************************************************************
*****功能说明：1.CLI方式编辑SID并发送
**************2.接收SID对应的DATA并显示
*******************************************************************************************************************************************/
/*
快速配置步骤：
1、宏定义修改
DEFAULTDIR指通过网页访问文件系统的根路径，注意系统中是否有/home，没有的话可以自行决定修改为某个路径，对正常运行没有太大影响
PhysicalPort指CoLoR协议发出Get包和接收Data包的网卡端口，注意网卡的默认有线端口名称是否为eth0，而Fedora20系统中的默认名称为em1，请注意识别
2、系统设置
在Fedora系统中因需要使用原始套接字发送自定义格式的数据包，须关闭Fedora的防火墙，命令：
sudo systemctl stop firewalld.service
在Ubuntu系统中无需任何操作
3、编译命令
gcc stringclient.c -o stringclient -lpthread
4、运行（因涉及原始套接字的使用，须root权限）
sudo ./stringclient
*/
#include"transportlayerdefine.h"
#include"subscriber.h"

/*******************************************************************************************************************************************
*************************************宏定义配置数据************全局变量定义******************************************************************
*******************************************************************************************************************************************/
#ifndef _STRCLI_
#define _STRCLI_

sem_t trigger;
int flag;

/*******************************************************************************************************************************************
*******************************************初始化参数配置相关********************************************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：StringClient_Parameterinit
* 功能描述：StringClient模块全局变量赋初值
* 参数列表：
* 返回结果：
*****************************************/
void
StringClient_Parameterinit();

/*******************************************************************************************************************************************
*******************************************应用层StringClient服务器（通过CLI控制）******************************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：StringClient
* 功能描述：
* 参数列表：
* 返回结果：
*****************************************/
void
StringClient
(
);

/*******************************************************************************************************************************************
*******************************************上行通道 - From.数据请求端   To.应用服务器*********************************************************
*******************************************************************************************************************************************/

/*******************************************************************************************************************************************
*******************************************下行通道 - From.应用服务器 To.数据请求端***********************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：StringClient_StringTransport
* 功能描述：
* 参数列表：
* 返回结果：
*****************************************/
void
StringClient_StringTransport
(
	struct timeval * tv,
	fd_set * readfds
);

/*******************************************************************************************************************************************
**********************************************************多线程主干程序********************************************************************
*******************************************************************************************************************************************/

/*****************************************
* 函数名称：StringClient_thread_timer
* 功能描述：为各线程提供计时信号
* 参数列表：
* 返回结果：
*****************************************/
void *
StringClient_thread_timer
(
	void * fd
);

/*****************************************
* 函数名称：StringClient_thread_NetworkLayertoTransportLayer
* 功能描述：上行通道 - From.数据请求端   To.应用服务器
* 参数列表：
* 返回结果：
*****************************************/
void *
StringClient_thread_NetworkLayertoTransportLayer
(
	void * fd
);

/*****************************************
* 函数名称：StringClient_thread_TransportLayertoNetworkLayer
* 功能描述：下行通道 - From.应用服务器 To.数据请求端
* 参数列表：
* 返回结果：
*****************************************/
void *
StringClient_thread_TransportLayertoNetworkLayer
(
	void * fd
);

/*****************************************
* 函数名称：StringClient_main
* 功能描述：StringClient模块主函数，启动ForwardingPlane转发平面线程。自身主循环执行简单HTTP服务器功能。
* 参数列表：
eg: ./sub d1sub1 d1sub1-eth1
第二参数使用char**argv的方式声明报错，不知是不是语法问题
* 返回结果：
*****************************************/
int
StringClient_main
(
	int argc,
	char argv[][30]
);

#endif
